# ExternallyTaggedGeometryObject Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedGeometryObject Members
ExternallyTaggedGeometryObject Class Methods Properties See Also
---
The ExternallyTaggedGeometryObject type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExternallyTaggedGeometryObject |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalId | The external Id of the geometry object. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace